[
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "2 apples, peeled, cored, cut into 1/2-inch pieces (2- 1/2 to 3 cups chopped)",
      "1-1/2 cups milk",
      "1-1/2 cups water",
      "1 cup uncooked steel-cut oats",
      "2 tablespoons brown sugar",
      "1-1/2 tablespoons butter, cut into 5-6 pieces 1/2 teaspoon cinnamon",
      "1 tablespoon ground flax seed",
      "1/4 teaspoon salt",
      "Optional garnishes: chopped nuts, raisins, maple syrup, additional milk or butter"
    ],
    "steps": [
      "Coat inside of 3 - 1/2 quart (or larger) slow cook- er with cooking spray. Add all ingredients (except optional toppings) to slow cooker. Stir, cover, and cook on low for approx. 7 hours (slow cooker times can vary). Spoon oatmeal into bowls; add optional toppings, if desired. Store leftovers in refrigerator. Freezes well.",
      "To reheat single servings: Put 1-cup cooked oatmeal in microwave proof bowl. Add 1/3 cup milk. Micro- wave on high for 1 minute; stir. Continue cooking for another minute, or until hot.",
      "Recipe can be doubled in 6-quart or larger slow cooker. Increase cooking time 1 hour."
    ],
    "title": "Overnight, Slow Cooker, Apple Cinnamon Steel-Cut Oatmeal",
    "image": "Overnight, Slow Cooker, Apple Cinnamon Steel-Cut Oatmeal.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "10 oz baby spinach",
      "3 small gala apples or 2 medium, cored and thinly sliced",
      "1 cup pecans, toasted",
      "4 oz feta cheese, crumbled (don’t use the pre-crum- bled stuff)",
      "1/2 cup dried cranberries",
      "12 oz bacon, cooked and crumbled (optional)",
      "1/2 small red onion, sliced into thin strips (optional)",
      "Maple-Cider Vinaigrette 1/2 cup olive oil",
      "1/4 cup apple cider vinegar 2 Tbsp pure maple syrup",
      "2 tsp dijon mustard",
      "1/4 tsp salt",
      "1/4 tsp freshly ground black pepper"
    ],
    "steps": [
      "If using red onion, place slices in a colander and run under warm water for about 10 seconds, tossing once, to remove harsh bite. Drain well.",
      "In a large salad bowl toss together spinach, apples, pecans, feta, cranberries and optional bacon and red onion. Drizzle desired amount of dressing over sal- ad and toss to evenly coat. Serve immediately after adding dressing.",
      "For the dressing:",
      "Add all ingredients to a medium mason jar. Cover with lid and shake to blend well (or alternately just blend well in a bowl with a whisk)."
    ],
    "title": "Apple Pecan Feta Spinach Salad with Maple Cider Vinaigrette",
    "image": "Apple Pecan Feta Spinach Salad with Maple Cider Vinaigrette.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "3 medium bananas mashed 1/2 cup oil",
      "2 eggs",
      "1 cup sugar",
      "1 1/2 cup flour",
      "1 tsp baking soda",
      "1/4 tsp salt",
      "1 tsp vanilla",
      "1/2 cup chopped pecans"
    ],
    "steps": [
      "Preheat oven to 350",
      "In a bowl, mix all ingredients by hand until well incorporated",
      "Pour into a greased (and sprinkled with lots of sug- ar) bread pan (approx 9x4x4)",
      "Bake 50 minutes to 1 hour or until browned and toothpick inserted in middle comes out clean (check at about 50 minutes)",
      "Cool on rack"
    ],
    "title": "Banana Bread",
    "image": "BANANA BREAD.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "1 cup chuck roast beef, chopped into 1 inch strips 1Tbsp oil",
      "1 medium yellow onion, chopped",
      "1 cup fresh pumpkin (or potatoes) peeled and cubed 2 cups canned coconut milk",
      "1 medium Aneheim chile, chopped",
      "3 Tbsp red curry paste (or to taste)",
      "1/2 cup basil or cilantro, chopped"
    ],
    "steps": [
      "Brown meat on high heat and soften onions in the oil.",
      "Turn heat to low and mix in curry paste.",
      "Stir in coconut milk, cover and simmer for 15 - 20 min.",
      "-Add pumpkin (or potatoes )and cook over medium heat until pumkin is tender.",
      "Serve by ladling mixture over bowls of rice. Garnish with basil or cilantro and add chiles to taste.",
      "(If using powdered curry, start by warming up curry powder in a dry pan for a minute or two, then con- tinue with teh meat and onions as above.)"
    ],
    "title": "Beef and Pumpkin Curry",
    "serves": 4,
    "image": "Beef and Pumpkin Curry.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "1 can (15 ounce) or 1 1/2 cups cooked chickpeas, drained and rinsed",
      "1/2 teaspoon ground cumin",
      "1/2 teaspoon smoked paprika",
      "1/4 teaspoon salt",
      "2 cloves garlic",
      "2 tablespoons tahini",
      "1 tablespoon hot sauce (I used Frank’s Hot Sauce) 1 tablespoon lemon juice",
      "1/2 cup jarred roasted red pepper",
      "2 tablespoons olive oil or liquid from can Cayenne pepper, to taste, for serving"
    ],
    "steps": [
      "1. Combine all the ingredients except the oil (or water) and cayenne. in a food processor. Pulse a few times to combine and then scrape down the sides. With the motor running, stream in the oil (or water) through the feed tube.",
      "2. Continue to run the motor until you reach the desired consistency; I like to let it for for 5 minutes to get it really smooth.",
      "3. Add more salt, lemon juice, or hot sauce, to taste, and then sprinkle with cayenne pepper.",
      "Makes 2 cups"
    ],
    "title": "Buffalo Wings Hummus",
    "image": "Buffalo Wings Hummus.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "Marinade",
      "1/2 cup plain yoghurt, full fat",
      "1 tbsp lemon juice",
      "1 tsp tumeric powder",
      "2 tsp garam masala (Note 1)",
      "1/2 tsp chili powder or cayenne pepper powder (Note 2)",
      "1 tsp ground cumin",
      "1 tbsp fresh grated ginger",
      "2 cloves garlic, crushed",
      "1.5 lb / 750 g chicken thigh fillets, cut into bite size pieces",
      "Curry",
      "1 tbsp vegetable oil or ghee (Note 3)",
      "1 cup tomato passata or puree (Note 4)",
      "1 tbsp sugar",
      "1 1/4 tsp salt",
      "1 cup cream OR for a lighter version use 3/4 cup light cream + 1/4 cup milk (full fat or low fat, I used this)",
      "To serve",
      "Rice",
      "Coriander/cilantro (optional)"
    ],
    "steps": [
      "Optional step: for an extra smooth sauce, combine the Marinade ingredients (except the chicken) in a food processor and blend until smooth.",
      "Combine the Marinade ingredients with the chicken in a bowl. Cover and refrigerate overnight, or up to 24 hours.",
      "Heat the vegetable oil over high heat in a large fry pan. Take the chicken out of the Marinade but do not wipe or shake off the marinade from the chicken (but don’t pour the Marinade left in the bowl into the fry pan).",
      "Place chicken in the fry pan and cook for around",
      "3 minutes, or until the chicken is white all over (it doesn’t really brown because of the Marinade). Add the tomato passata, sugar and salt. Turn down to low and simmer for 20 minutes.",
      "Do a taste test to see if it needs more salt. Stir through the cream, then remove from heat. Garnish with coriander/cilantro leaves if using. Serve with basmati rice.",
      "The Butter Chicken is pictured with my very easy No Yeast Flatbread and no-fry papadums (Note 5)."
    ],
    "title": "Butter Chicken",
    "image": "BUTTER CHICKEN.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "1 large carrot, peeled and roughly chopped 1 small shallot, peeled and roughly chopped 2 tablespoons roughly chopped fresh ginger 2 tablespoons sweet white miso",
      "2 tablespoons rice vinegar",
      "2 tablespoons toasted sesame seed oil",
      "1/4 cup grapeseed or another neutral oil",
      "2 tablespoons water",
      "Salad: Romaine lettuce avocado cucumber"
    ],
    "steps": [
      "Blitz the carrots, shallot and ginger in a blender or food processor until finely chopped. Scrape down the sides, then add the miso, vinegar and sesame oil. While the machine running, slowly drizzle in the grapeseed oil and the water.",
      "Divide the lettuce among four bowls, add some of the onion and a quarter of the avocado. Drizzle with plenty of dressing and serve."
    ],
    "title": "Carrot Ginger Dressing",
    "image": "Carrot Ginger Dressing.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "1/4 cup mayonnaise",
      "2 tablespoons honey",
      "1 tablespoon yellow mustard",
      "2 teaspoons Dijon mustard",
      "2 teaspoons freshly squeezed lemon juice 2 tablespoons BBQ sauce"
    ],
    "steps": [
      "Whisk together mayonnaise, honey, mustards, lem- on juice and BBQ sauce.",
      "Store in refrigerator in a closed container."
    ],
    "title": "Chick-Fil-A Sauce",
    "image": "CHICK-FIL-A SAUCE.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "2 cups shredded chicken breast",
      "1/4 cup Greek yogurt",
      "Kosher salt and freshly ground black pepper, to taste 1 baguette, cut into 3-4 equal pieces, toasted",
      "2 cups arugula, for serving",
      "2 Roma tomatoes, thinly sliced, for serving",
      "8 ounces mozzarella, sliced",
      "For the basil pesto",
      "1 cup fresh basil leaves",
      "3 cloves garlic, peeled",
      "3 tablespoons pine nuts",
      "1/3 cup grated Parmesan",
      "Kosher salt and freshly ground black pepper, to taste 1/3 cup olive oil"
    ],
    "steps": [
      "To make the pesto, combine basil, garlic, pine nuts and Parmesan in the bowl of a food proces- sor; season with salt and pepper, to taste. With the motor running, add olive oil in a slow stream until emulsified; set aside.",
      "In a large bowl, combine chicken, 1/2 cup pesto, Greek yogurt, salt and pepper, to taste.",
      "Serve sandwiches on baguette with arugula, toma- toes, mozzarella and chicken pesto mixture."
    ],
    "title": "Chicken Pesto Sandwich",
    "serves": 4,
    "image": "Chicken Pesto Sandwich.png"
  },
  {
    "author": "Jamie Oliver",
    "ingredients": [
      "2 onions",
      "600 g free-range chicken thighs , skin off, bone out 350 g mixed mushrooms",
      "1 bunch of fresh thyme (30g)",
      "375 g block of all-butter puff pastry , (cold)"
    ],
    "steps": [
      "Preheat the oven to 220oC/425oF/gas 7. Place a 30cm non-stick ovenproof frying pan on a high heat, with a smaller non-stick pan on a medium heat alongside. Pour 1 tablespoon of olive oil into the larger pan. Peel and roughly chop the onions, adding them to the larger pan as you go. Roughly chop two- thirds of the thighs, finely chop the rest, and add to the onion pan. Cook for 6 min- utes, or until golden, stirring occasionally.",
      "Meanwhile, place the mushrooms in the dry pan, tearing up any larger ones. Let them toast and get nutty for 4 minutes, then tip into the chicken pan and strip in half the thyme leaves.",
      "Remove the pan from the heat, add a pinch of sea salt and black pepper, then stir in 1 tablespoon of red wine vinegar and 150ml of water. Working quickly, roll out",
      "the pastry so it’s 2cm bigger than the pan, then place it over the filling, using a wooden spoon to push it into the edges. Very lightly criss-cross the pastry, then brush with 1 teaspoon of olive oil. Poke the remaining thyme sprigs into the middle of the pie. Bake at the bottom of the oven for 15 minutes, or until golden and puffed up. Easy!"
    ],
    "title": "Chicken pot pie",
    "image": "Chicken pot pie.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "2 tablespoons olive oil",
      "1 medium onion, diced small",
      "3 cloves garlic, minced",
      "2 teaspoons curry powder",
      "1⁄4 teaspoon crushed red pepper flakes {optional} 2 tablespoons fresh parsley, chopped",
      "{1} cans full-fat or lite coconut milk",
      "{1} can or 1/1 cup chickpeas {rinsed + cooked}",
      "1 tablespoon lemon juice",
      "4 large handfuls baby spinach",
      "sea salt, to taste",
      "black pepper, to taste"
    ],
    "steps": [
      "In a large sauté pan heat the olive oil over low heat. Add in the onions and sauté for 5 minutes.",
      "Add in the garlic, curry powder and crushed red pepper flakes and cook for an additional 1 - 2 min- utes.",
      "This will help release the aromas in the spices.",
      "Add in the parsley, coconut milk and chickpeas. Bring to a gentle simmer and cook for 10 minutes. Lastly, add in the lemon juice and spinach and cook for 1 minute more or until the spinach leaves are lightly wilted.",
      "Taste, season with salt and pepper and serve warm."
    ],
    "title": "Coconut Curry Chickpeas with Wilted Greens",
    "image": "Coconut Curry Chickpeas with Wilted Greens.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "3 eggs",
      "1 1/2 cups milk",
      "1 cup plus 2 Tbsp four 1 Tbsp sugar",
      "1/4 tsp salt",
      "2 Tbsp melted butter"
    ],
    "steps": [
      "1. Put all ingredients in a blender in the order listed and blend until smooth. Let sit in refridgerator for 30 min. or overnight.",
      "2. When it’s time to cook the crepes, blend the batter till smooth. Pour a thin amount of batter onto a lightly buttered hot pan.",
      "3. Cook till able to flip over and cook till just golden brown.",
      "Makes 12 crepes",
      "Fill with:",
      "Jam and cream cheese",
      "Nutella and ice cream Strawberries and Vanilla pudding",
      "Sprinke with powdered sugar."
    ],
    "title": "Crepes",
    "image": "Crepes.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "2 cups / 300g plain flour (all purpose flour) (level cups, unsifted, not packed), + keep 1/4 cup extra for dusting & adjusting dough",
      "1/2 tsp salt",
      "3 1/2 tbsp / 50g butter (1.75 oz) 3/4 cup / 185 ml milk",
      "1/2 tbsp oil (for cooking)"
    ],
    "steps": [
      "Combine butter and milk and heat until butter is just melted - on stove or in microwave.",
      "Combine 2 cups flour, salt, butter and milk.",
      "Sprinkle work surface with flour then knead for a few minutes until it is smooth - it doesn’t need much knead- ing. Add extra flour if the dough is too sticky.",
      "Wrap with cling wrap and rest at room temperature for 30 minutes or so.",
      "Dust bench top with flour, cut dough into 4 pieces, roll into balls, then roll out into about 1/8” / 0.3cm thick rounds.",
      "Heat 1/2 tbsp olive oil in a non stick pan over medium heat - or lower if you have a heavy based skillet. (Note 1) Place one flatbread in the pan, cook for around 1- 1 1/2 minutes - it should bubble up (see photo in post)- then flip and cook the other side, pressing down if it puffs up. There should be a smallish golden brown spots on both sides.",
      "Stack the cooked bread and keep wrapped with a tea towel - the moisture helps soften the surface, making them even more pliable.",
      "Continue to cook with remaining pieces.",
      "Optional: Brush or spray bread with olive oil or melted butter, for a more luxurious finish. Or even with melt- ed butter mixed with minced garlic for a garlic butter version!"
    ],
    "title": "Easy Soft Flatbread",
    "image": "EASY SOFT FLATBREAD.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "4 Sole, cod or hallibut filet 3 Tbsp four",
      "7 oz clarified butter",
      "2 Tbsp lemon juice",
      "4 Tbsp chopped parsley lemon wedges"
    ],
    "steps": [
      "Pat the fish dry with paper towels",
      "Dust lightly with flour and season with salt and pepper",
      "Heat 5 oz of butter in a frying pan (if large enough to fit fish, if not use half the butter and cook in 2 batches)",
      "Put the fish in the pan and cook for 4 minutes on each side or until golden.",
      "Lift the fish out onto warm plates and drizzle with lemon juice and parsley.",
      "Add the remaining butter to the pan and heat until it browns to make a beurre noisett. Pour over the fish (it will foam as it mixes with the lemon juice) and serve with lemon wedges."
    ],
    "title": "Filet of Sole Meunière",
    "image": "Filet of Sole Meunière.png"
  },
  {
    "author": "Jamie Oliver",
    "ingredients": [
      "300 g sirloin steak , (ideally 1.5cm thick) 4 cm piece of ginger",
      "1 tablespoon miso paste",
      "2 teaspoons runny honey",
      "2 pak choi pak choi (250g)"
    ],
    "steps": [
      "Pull the fat off the sirloin, finely slice the fat and place it in a cold non-stick frying pan. Put on a medium-high heat to crisp up while you peel and matchstick the ginger, then add that to crisp up, too. Cut off the sinew, then dice the steak into 3cm chunks and toss with the miso until well coated. Scoop the crispy fat and ginger out and put aside, then add the steak chunks to the pan. Cook for 4 minutes, tossing regularly, then drizzle in the hon- ey and 1 tablespoon of red wine vinegar. Toss for 1 more minute until shiny and sticky.",
      "Meanwhile, halve the pak choi, cook in a pan of boiling water for just 1 minute so they retain a bit of crunch, then drain well and plate up. Spoon over the steak and sticky juices from the pan, and finish with the reserved crispy bits."
    ],
    "title": "Ginger shakin’ beef",
    "image": "Ginger shakin’ beef.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "Dry ingredients:",
      "2 1/2 cups all-purpose flour 1 tsp baking powder",
      "1/4 tsp baking soda",
      "1/4 tsp salt",
      "1 tsp ground cinnamon",
      "1 tsp ground ginger",
      "1 tsp ground cloves",
      "1/4 tsp ground allspice",
      "1 egg",
      "1 cup firmly packed brown sugar 2/3 cup dark molasses",
      "6 Tbsp softened butter"
    ],
    "steps": [
      "-Sift together dry ingredients",
      "-mix with other ingredients",
      "-cover and refrigerate for 1 hour.",
      "-Preheat oven to 350 degrees F",
      "-Roll out onto floured board to 1/4 inch thick -cut into cookies. ",
      "-Bake for 8 min.",
      "Makes about 50 cookies."
    ],
    "title": "Gingerbread cookies",
    "image": "Gingerbread cookies.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "2 cups dried chickpeas, soaked overnight; drained 1⁄2 cup tahini",
      "3⁄4 cup olive oil, plus more",
      "1⁄4 cup fresh lemon juice",
      "2 tsp. ground cumin",
      "2 cloves garlic, peeled",
      "1 small red Thai chile, stemmed and seeded Kosher salt, to taste"
    ],
    "steps": [
      "Bring chickpeas and 4 cups water to a boil in a 4-qt. saucepan. Reduce heat to medium-low and cook, covered, until chickpeas are very tender, 1-1 1⁄2 hours.",
      "Drain, reserving 1⁄2 cup cooking liquid; cool to room temperature.",
      "Transfer all but 3⁄4 cup chickpeas to a food proces- sor with the tahini, oil, juice, cumin, garlic, chile, and salt; purée until smooth.",
      "Add reserved cooking liquid and continue to purée until airy in consistency, about 5 minutes.",
      "Transfer hummus to a serving dish. Top with re- maining whole chickpeas, drizzle with more oil, and sprinkle with salt."
    ],
    "title": "Hummus (Galilean - Style)",
    "image": "Hummus (Galilean - Style).png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "1 Tbsp. vegetable oil",
      "3 bone-in/skin-on chicken legs (or 6 thighs/3 breasts)",
      "Salt and pepper",
      "1 Tbsp unsalted butter",
      "1 large onion, thinly sliced",
      "4 cloves garlic, chopped",
      "1 Tbsp. grated peeled ginger",
      "2 tsp. coriander",
      "2 tsp. cumin",
      "2 Tsp. turmeric",
      "1/4 tsp. cayenne pepper",
      "1-15oz. can chickpeas, drained and rinsed",
      "2 cups chicken broth",
      "6-8 cups lightly packed baby spinach",
      "1/4 cup Greek yogurt",
      "1/4 cup fresh cilantro or flat-leafed parsley, roughly chopped"
    ],
    "steps": [
      "Preheat oven to 325° F. with rack in lower 1/3 of oven.",
      "Pan chicken dry and season with salt and pepper. Heat 1 Tbsp. oil in an oven-safe pan (with a lid, such as a Dutch oven) on stove-top over medium-high heat.",
      "Brown chicken on both sides until golden and remove to a plate.",
      "Add butter and onions to pan (don’t remove drippings unless exces- sive).",
      "Cook, stirring regularly, until onions are soft and golden brown, about 10 minutes. (Don’t rush browning the onions, as cooking them to golden adds great flavour to the dish).",
      "Stir in garlic, ginger and spices.",
      "Cook, stirring constantly, about 1 minute. Stir in chickpeas and 2 cups of broth. Return chicken to pan and any accumulated juices. Liquid should cover chicken by about 2/3. If not, add a bit more broth to top up.",
      "Bring liquid to a simmer, then cover and transfer to the pre-heated oven. Cook until chicken is fork-tender, about 45 minutes, depending on the cut of chicken you used.",
      "Remove from oven and transfer chicken to a plate.",
      "Cover with foil to keep warm. To hot liquid in pot, add spinach. Cover and let stand about 5 minutes, or until spinach is wilted. Stir in yogurt.",
      "Taste and season with salt and pepper, to taste. (If sauce is not as",
      "thick as you’d like, mix a bit of the sauce with a couple of teaspoons of cornstarch to make a paste.",
      "Add a bit at a time to the warm sauce and stir until desired thickness). Return chicken to pot and warm over low heat (do not boil or yogurt may curdle).",
      "Transfer chicken to a serving platter and pour spinach and chickpea sauce over. Sprinkle with chopped cilantro or parsley."
    ],
    "title": "Indian-Spiced Chicken And Chickpeas",
    "image": "Indian-Spiced Chicken And Chickpeas.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "7 quarts water",
      "2 cup sugar (regular granulated sugar works best) 16 bags black tea, green tea, or a mix (or 2 table- spoons loose tea)",
      "4 cups starter tea from last batch of kombucha or store-bought kombucha (unpasteurized, neutral-fla- vored)",
      "1 scoby per fermentation jar",
      "Optional flavoring extras for bottling: 2 to 4 cups chopped fruit, 4 to 6 cups fruit juice, 2 to 4 table- spoons flavored tea (like hibiscus or Earl Grey), 1/2 cup honey, 4 to 8 tablespoons fresh herbs or spices"
    ],
    "steps": [
      "Equipment",
      "Stock pot",
      "one - 2 gallon glass jar or four - 2 quart glass jars Tightly woven cloth (like clean napkins or tea towels), coffee filters, or paper towels, to cover the jar",
      "Bottles: Six 32-oz glass bottles with plastic lids",
      "Small funnel",
      "Note: Avoid prolonged contact between the kombucha and metal",
      "both during and after brewing. This can affect the flavor of your kombucha and weaken the scoby over time.",
      "Make the tea base: Bring the water to a boil. Remove from heat and stir in the sugar to dissolve. Drop in the tea and allow it to steep until the water has cooled.",
      "Add the starter tea: Once the tea is cool, remove the tea bags or strain out the loose tea. Stir in the starter tea. (The starter tea makes the liquid acidic, which prevents unfriendly bacteria from taking up residence in the first few days of fermentation.)",
      "Transfer to jars and add the scoby: Pour the mixture into 2-gallon glass jar (or divide between four 2-quart jars, in which case you’ll need 4 scobys) and gently slide the scoby into the jar with clean hands. Cover the mouth of the jar with a few layers tightly-woven cloth.",
      "Ferment for 7 to 10 days:",
      "After 7 days, begin tasting the kombucha daily by pouring a little out of the jar and into a cup. When it reaches a balance of sweetness and tartness that is pleasant to you, the kombucha is ready to bottle.",
      "Remove the scoby:",
      "Bottle the finished kombucha: Measure out your starter tea from this batch of kombucha and set it aside for the next batch. Pour the fermented kombucha (straining, if desired) into bottles using the small funnel, along with any juice, herbs, or fruit you may want to use as flavoring. Leave about a half inch of head room in each bottle.",
      "Carbonate and refrigerate the finished kombucha: Store the bottled kombucha at room temperature out of direct sunlight and allow 1 to 3 days for the kombucha to carbonate. Refrigerate to stop fermentation and carbonation, and then consume your kombucha within a month.",
      "Make a fresh batch of kombucha: Clean the jar being used for kombucha fermentation. Combine the starter tea from your last batch of kombucha with the fresh batch of sugary tea, and pour it into the fermentation jar. Slide the scoby on top, cover, and ferment for 7 to 10 days."
    ],
    "title": "Kombucha",
    "image": "Kombucha1.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "2 Tbsp extra virgin olive oil, divided 1 lb lean ground beef",
      "1 large yellow onion, diced (2 cups) 3 - 5 garlic cloves, to taste, minced",
      "4 cups low-sodium chicken broth",
      "1 (14.5 oz) can petite diced tomatoes",
      "1 (14.5 oz) can crushed tomatoes",
      "2 1/2 Tbsp tomato paste",
      "1 3/4 tsp dried basil",
      "3/4 tsp dried oregano",
      "1/2 tsp dried rosemary, crushed",
      "1/2 tsp fennel seeds, crushed",
      "1/2 tsp dried thyme",
      "1 tsp granulated sugar",
      "1 1/2 Tbsp chopped fresh parsley, plus more for garnish",
      "Salt and freshly ground black pepper, to taste",
      "8 lasagna noodles, broken into bite size pieces (6.5 oz)",
      "1 1/4 cups shredded mozzarella cheese (5 oz)",
      "1/2 cup finely shredded parmesan cheese (2 oz)",
      "8 oz ricotta cheese"
    ],
    "steps": [
      "Heat one tablespoon olive oil in a large pot over medium-high heat. Once hot, crumble beef into pot, season with salt and pepper to taste and cook, stirring occasionally until browned. Drain majority of fat from beef and set aside (you can drain",
      "it all if you want it to be healthier I just like the little bit of flavor a small amount of the fat gives). Heat remaining 1 Tbsp olive oil in pot, add chopped yellow onion and saute until it begins to soften, about 3 minutes. Add in garlic and saute 30 seconds longer. Add in chicken broth, diced tomatoes, crushed tomatoes, tomato paste, basil, oregano, rosemary, fennel seeds, thyme, sugar, parsley, the cooked ground beef and season with salt and pepper to taste. Bring just to a boil, then reduce heat to medium-low, cover and simmer 20 minutes.",
      "Meanwhile, prepare lasagna noodles according to directions listed on package, reserving 1 cup pasta water before draining pasta.",
      "Add cooked pasta to soup along with 1/2 cup - 1 cup pasta water as desired. In a mixing bowl, using a fork, stir together mozzarella, parmesan and ricotta.",
      "Ladle soup into bowls, dollop with a large scoop of the cheese mixture and sprinkle with chopped parsley (you can help the cheese melt better by cooking in the microwave after dolloping over soup for a bit or you could put the soup in oven safe bowl, top with cheese mixture and set under broiler to melt well. Or just stir into very hot soup and it should melt well)."
    ],
    "title": "Lasagna Soup",
    "image": "Lasagna Soup.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "Makes 6 mason jar cheesecakes",
      "— 14 whole graham crackers (the gluten-free variety work great too)",
      "— 4 tablespoons unsalted butter, melted",
      "— 3 tablespoons brown sugar",
      "— pinch of salt",
      "— 2.5 cups fresh blueberries",
      "— juice of half a lemon",
      "— 2 tablespoons cold water",
      "— 1⁄2 cup fine granulated sugar",
      "— 1 tablespoon cornstarch mixed with 2 table- spoons cold water",
      "— (2) 8-ounce packs cream cheese",
      "— 1 teaspoon vanilla extract",
      "— 3⁄4 cup confectioner’s sugar",
      "— 3⁄4 cup heavy cream",
      "— lemon zest",
      "1. Put graham crackers into a large bowl and crush into crumbs using the end of a rolling pin. Mix in the melted butter, brown sugar and a pinch of salt until thoroughly combined. Put to one side.",
      "2. Place the blueberries, lemon juice and granulated"
    ],
    "steps": [
      "sugar in a pan and heat gently until the blueberries start to break down and the mixture is hot. Gently stir in the cornstarch mix (as not to break up the blueberries too much) and heat through, while stir- ring for another 30 seconds until the blueberry mix has thickened. Turn off the heat and allow to cool. 3. Place the cream cheese in a bowl and mix with a hand whisk until the cream cheese has loosened to a smooth consistency. Add the vanilla extract and confectioner’s sugar, then whisk again until com- bined.",
      "4. Whisk the heavy cream in a separate bowl until thick, but still soft.",
      "5. Spoon the whipped cream into the cream cheese and gently stir to combine.",
      "6. Spoon 3 heaping tablespoons of the cracker crumbs into the bottom of a mason jar and push down with a spoon or the end of a small rolling pin. Gently spoon on 2 heaping tablespoons of the cream cheese mixture and level it. Add 2 tablespoons of the blueberry mixture.",
      "7. Repeat for the other mason jars, then top with a little lemon zest. Put the lid on and refrigerate until needed."
    ],
    "title": "No-Bake Mason Jar Cheesecakes",
    "image": "No-Bake Mason Jar Cheesecakes.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "3 Tbsps. oil",
      "1 lb. pork loin, cubed bite-size",
      "1 cup onion, chopped",
      "2 tsps. garlic, minced",
      "5 cups chicken broth",
      "1 (14.5 oz.) can mild red enchilada sauce",
      "1 (4.5 oz.) can chopped green chilies",
      "1 tsp. each ancho chile powder, chili powder, cumin 1⁄2 tsp. each Mexican oregano, paprika",
      "1 (15.5 oz.) can white hominy, drained",
      "1 Tbsp. lime juice",
      "1⁄3 cup fresh cilantro, chopped"
    ],
    "steps": [
      "Heat oil in large pot on medium heat. Add pork, onion, and garlic. Sauté 3-4 minutes searing pork on all sides.",
      "Stir in broth, enchilada sauce, green chilies, and spices. Bring to a boil on high heat. Cover and re- duce heat to low. Simmer 40 minutes.",
      "Add hominy. Cover and simmer 10 minutes.",
      "Stir in lime juice and cilantro."
    ],
    "title": "Mexican Pozole (Posole)",
    "image": "Mexican Pozole (Posole).png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "3 tablespoons neutral oil (such as peanut, canola, vegetable, etc).",
      "1 1/2 tablespoons rice vinegar",
      "2 teaspoons white miso",
      "1/4 teaspoon (a drop) sesame oil 1/2 teaspoon honey or maple syrup 1/2 teaspoon soy sauce"
    ],
    "steps": [
      "Combine the ingredients in a bowl and whisk until smooth, adding a dash more vinegar or honey to taste. Feel free to spice it up with some Sriracha, a hit of hot pepper flakes, some grated fresh ginger or even a teaspoon of peanut butter."
    ],
    "title": "Miso Dressing",
    "image": "Miso Dressing.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "8 cups water",
      "1 1/2 teaspoons instant dashi granules (asian instant broth granules)",
      "1/4 cup miso paste",
      "1 tablespoon dried seaweed (for miso soup), soaked in water",
      "1/2 cup cubed tofu",
      "2 tablespoons chopped green onion"
    ],
    "steps": [
      "1. Pour the water into a pot and bring to a boil. Add the instant dashi and whisk to dissolve. Turn the heat to medium-low and add the tofu. Drain the seaweed and add the seaweed to the pot. Simmer for 2 minutes.",
      "2. In the meatime, Spoon the miso paste into a bowl. Ladle about 1/2 cup of the hot dashi broth into a bowl and whisk with chopsticks or a whisk to mix and melt the miso paste so that it becomes a smooth mixture.",
      "3. Turn the heat off, add the miso paste to the pot and stir well. Taste the soup - if it needs more flavor, whisk in another tablespoon or two of miso paste. Top with green onions and serve immediately."
    ],
    "title": "Miso Soup",
    "image": "Miso Soup.png"
  },
  {
    "author": "Jamie Oliver",
    "ingredients": [
      "300 g white basmati rice",
      "6 heaped teaspoons green olive tapenade",
      "350 g ripe mixed-colour cherry tomatoes",
      "1⁄2 a bunch of fresh basil , (15g)",
      "500 g white fish fillets , such as haddock, skin off, pin-boned, from sustainable sources"
    ],
    "steps": [
      "In a large shallow casserole pan on a high heat, mix the rice with 2 heaped teaspoons of tapenade, then pour over 600ml of water. Put the lid on and let it come to the boil while you halve the tomatoes and, in a bowl, mix them with 1 tablespoon each of olive oil and red wine vinegar. Taste, season to perfection with sea salt and black pepper, and tear in most of the basil leaves.",
      "Cut the fish into four equal-sized pieces and place in the pan, pushing them into the rice. Scatter over the dressed tomatoes. Put the lid back on and boil for 10 minutes, or until the rice is cooked through, then re- move the lid and cook for a further 2 minutes until all the liquid has evaporated. Spoon the remaining tapenade over the fish, pick over the remaining basil leaves, drizzle lightly with extra virgin olive oil, and dish up."
    ],
    "title": "One-pan fabulous fish",
    "image": "One-pan fabulous fish.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "1/2 cup butter",
      "1 cup minced celery",
      "3 tablespoons minced shallots 1 quart half-and-half cream",
      "2 (12 ounce) containers fresh shucked oysters, undrained",
      "salt and ground black pepper to taste",
      "1 pinch cayenne pepper, or to taste"
    ],
    "steps": [
      "Melt the butter in a large skillet over medium heat, and cook the celery and shallots until shallots are tender.",
      "Pour half-and-half into a large pot over medi- um-high heat. Mix in the butter, celery, and shallot mixture. Stir continuously. When the mixture is almost boiling, pour the oysters and their liquid into the pot. Season with salt, pepper, and cayenne pepper. Stir continuously until the oysters curl at the ends. When the oysters curl the stew is finished cooking; turn off the heat and serve."
    ],
    "title": "Oyster Stew",
    "image": "Oyster Stew.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "Cooking spray",
      "1 1/2 cups whole milk (see Ingredient Notes) 3 teaspoons powdered gelatin",
      "1/3 cup sugar",
      "1 1/2 cups light or heavy cream",
      "1 teaspoon pure vanilla extract",
      "Pinch salt"
    ],
    "steps": [
      "Lightly grease the ramekins: Spray the ramekins with cook-",
      "ing spray, then use a paper towel to wipe out most of the oil, leaving only a light residue.",
      "Bloom the gelatin: Pour the milk into the saucepan and sprinkle the powdered gelatin evenly over top. Let soften for 5 minutes or until the surface of the milk is wrinkled and the gelatin grains look wet and slightly dissolved.",
      "Dissolve the gelatin over low heat: Set the saucepan over low heat and warm the milk gently, stirring or whisking frequent- ly. The milk should never boil or simmer; if you see steam, remove the pot from the stove and let it cool down. The milk should get hot, but not so hot that you can’t leave your finger in the pot for a few seconds. The gelatin will dissolve quickly as the milk warms; it melts at body temperature so this step should go quickly.",
      "Check to make sure the gelatin is dissolved: After about 2 minutes of warming, rub a bit of the milk between your fingers to make sure it’s smooth. Or dip a spoon in the milk and check the back for distinct grains of gelatin.",
      "Dissolve the sugar: Stir the sugar into the milk and continue warming until it dissolves as well. It shouldn’t take more than 5 min- utes total to dissolve both the gelatin and sugar. Again, never let the mixture boil.",
      "Whisk in the cream and flavorings: Remove the saucepan from the heat. Whisk in the cream, vanilla, and a pinch of salt.",
      "Pour into the ramekins and chill: Divide the mixture evenly between the prepared ramekins and put in the refrigerator to chill.",
      "If serving straight from the cups, without unmolding, chill for 1 to 2 hours. If you want to unmold the panna cotta, chill for at least 4 hours or overnight.",
      "Prepare to unmold: Fill a large bowl partway with warm to hot water. Wipe a dessert plate with a damp paper towel (a damp plate lets you reposition the panna cotta more easily if it doesn’t fall in the right spot).",
      "Release the panna cotta edge from the cup: Run a thin knife care- fully around the sides of a ramekin. Don’t slide the knife all the way into the cup; just release the top edge of the pudding from the edge of the cup. Dip the ramekin in the warm water up to its rim, and hold it there for about 3 seconds.",
      "Unmold on a plate: Invert the ramekin over the plate and shake gently to help the panna cotta fall out, or press gently on one side",
      "to help nudge it out. It should fall out on the plate easily. (If it does not, return to the warm water bath in increments of 2 seconds.) Reposition on the plate if desired. Serve immediately, or refrigerate, lightly covered, for up to 5 days. The gelatin gets stronger as it sits, so this will be a bit rubbery by days 4 or 5, but you can mitigate this by letting the panna cotta sit at room temperature for about half an hour before serving."
    ],
    "title": "Panna Cotta",
    "image": "Panna Cotta.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "1 1/4 cups all-purpose flour 1/4 teaspoon salt",
      "1/2 cup butter, chilled and diced 1/4 cup ice water"
    ],
    "steps": [
      "In a large bowl, combine flour and salt. Cut in but- ter until mixture resembles coarse crumbs. Stir in water, a tablespoon at a time, until mixture forms a ball. Wrap in plastic and refrigerate for 4 hours or overnight.",
      "Roll dough out to fit a 9 inch pie plate. Place crust in pie plate. Press the dough evenly into the bottom and sides of the pie plate."
    ],
    "title": "Pie Crust",
    "image": "Pie Crust.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "2 Tbsp butter 2 eggs",
      "1 cup milk",
      "1 cup flour 1/4 tsp salt",
      "extra butter, jam or maple syrup for the popovers"
    ],
    "steps": [
      "1. Preheat oven to 375 degrees F.",
      "2. Brush the insides of muffin cups with melted butter.",
      "3. mix eggs, milk, flour and salt.",
      "4. pour batter into muffin cups (one-half to two- thirds full.",
      "5. Bake for 30 minutes",
      "6. Remove muffins from the pan and prick with a fork to let the steam escape. Spread with butter and/ or jam, and eat! (They also taste great dipped in maple syrup.)",
      "Makes 1 dozen."
    ],
    "title": "Popovers",
    "image": "POPOVERS.png"
  },
  {
    "author": "Jamie Oliver",
    "ingredients": [
      "800 g potatoes",
      "400 g piece of higher-welfare pork llet 2 sprigs of fresh sage",
      "40 g Cheddar cheese",
      "4 slices of higher-welfare prosciutto"
    ],
    "steps": [
      "Preheat the grill to high. Wash the potatoes, chop into 3cm chunks, then cook in a large pan of boiling salted water with the lid on for 12 minutes, or until tender. Meanwhile, put a shallow casserole pan on",
      "a high heat. Season the pork with sea salt and black pepper, then place in the pan with 1 tablespoon of olive oil and sear for 3 minutes, turning regularly, while you pick the sage leaves. Remove the pork to",
      "a plate, toss the sage leaves into the fat in the pan for just 5 seconds, then scoop on to a plate, leaving the pan o the heat to use again.",
      "Drain the spuds, tip into the casserole pan, grate over half the cheese, add 1 tablespoon of extra virgin olive oil and mash well, loosening with a splash of water, if needed. Taste, season to perfection, and spread out to the edges. Grate over the remaining cheese, sit the pork on top, then gratinate under the grill for 10 minutes. Lay the prosciutto around the pork in waves, sprinkle over the crispy sage, then grill for 2 more minutes, or until the pork is cooked to your liking. Rest for 2 minutes, then slice the pork and dish up."
    ],
    "title": "Pork & mash gratin",
    "image": "Pork & mash gratin.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "Pork Tenderloin:",
      "1 tablespoon olive oil",
      "2 pork tenderloins (3/4 - 1 pound each), trimmed Coarse salt and ground pepper",
      "Honey Mustard Sauce: 1/2 cup butter",
      "1/2 cup dijon mustard 1/4 cup honey",
      "2 Tbsp balsamic vinegar 1/3 cup sugar",
      "1 1/2 tsp salt"
    ],
    "steps": [
      "Heat oil in a large skillet over high heat. Season pork with salt and pepper; transfer to skillet and cook, turning, until browned all over, 5 to 10 minutes.",
      "Reduce heat to medium-low and cover skillet; cook pork, turning occasionally, until an instant-read thermometer registers 150 degrees. 20 to 25 min- utes.",
      "Remove pork from skillet, wrap in aluminum foil, and let rest 10 minutes (reserve skillet with juices).",
      "Slice pork thinly and serve with Honey Mustard sauce.",
      "For Sauce:",
      "1. Melt butter in a pan",
      "2. Add other ingredients",
      "3. Boil on med heat for 10 minutes."
    ],
    "title": "Pork Tenderloin with Honey Mustard BBQ Sauce",
    "image": "Pork Tenderloin with Honey Mustard BBQ Sauce.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "3 tbsp oil (any other than olive oil) (Note 1)",
      "4 tsp ginger, finely chopped",
      "5 large garlic cloves, minced (about 4 tsp minced garlic)",
      "1 large onion, finely diced (about 1 cup of onion) 1lb/500g ground beef (mince)",
      "3⁄4 tsp salt (I use table salt)",
      "1 - 11⁄2 tsp red chilli powder or cayenne pepper (Note 2)",
      "11⁄4 tsp garam masala (Note 3)",
      "11⁄4 tsp cumin powder",
      "11⁄4 tsp coriander powder",
      "1⁄2 tsp turmeric powder",
      "1 cup water",
      "Garnish",
      "1⁄2 tsp red chili flakes",
      "Cilantro/coriander leaves"
    ],
    "steps": [
      "Heat oil in a skillet over high heat.",
      "Add ginger and garlic and saute for 1 minute until fragrant - don’t let it burn!",
      "Add onion and cook for 1 minute until it is starting to turn translucent.",
      "Add beef and cook, breaking it up as you go, until it changes from pink to light brown.",
      "Add remaining ingredients EXCEPT water.",
      "Cook until the beef is cooked through - about 2 to 3 minutes.",
      "Add water, give it a stir, then put the lid on.",
      "Turn heat down to medium and let it simmer for 10 minutes or until most of the water has evaporated. Garnish with red chilli flakes and cilantro/coriander leaves.",
      "Serve with rice - and/or flatbreads!"
    ],
    "title": "Qeema Indian Curried Beef",
    "image": "QEEMA INDIAN CURRIED BEEF.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "1 pie crust in a 9 inch pie pan",
      "3 eggs",
      "1 1/3 cups half-and-half or whole milk",
      "1/2 tsp salt",
      "1/4 tsp pepper",
      "4 strips cooked bacon",
      "2 cups grated cheese (your favorite kind, Lorraine, Swiss cheese)"
    ],
    "steps": [
      "-Preheat oven to 375 degrees F",
      "-Crumble the bacon and sprinkle it in the pie shell. Sprinkle on about half of the grated cheese.",
      "-Ladle the egg mixture over the filling, then sprinkle on the remaining cheese.",
      "-Bake at 375 on the center oven rack until slightly puffy and golden brown, about 40 to 45 minutes.",
      "Serve warm, at room temperature, or cold. Makes 8 servings."
    ],
    "title": "Quiche Lorraine",
    "image": "Quiche Lorraine.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "Cookie base:",
      "1 1/4 cup flour",
      "1/2 tsp baking powder 1/4 tsp salt",
      "1/4 lb butter",
      "1/4 cup powdered sugar 1 tsp vanilla",
      "1 Tbsp whipped cream",
      "Top ring of cookie:",
      "2 1/4 cup almond flour 1 cup sugar",
      "1 Tbsp corn starch",
      "1 large egg",
      "1/2 tsp almond extract",
      "Raspberry jam",
      "1 egg white to brush on top of cookie"
    ],
    "steps": [
      "-Combine and mix ingredients for cookie base and the top ring of the cooking. Let both sit for 1 hour.",
      "-roll out base and cut out circles",
      "-push the almond top around the top of the edge of the base.",
      "-fill the center with Raspberry jam",
      "-brush top of cookie with egg white.",
      "-Bake in 350 degree oven for 8 - 10 min."
    ],
    "title": "Raspberry Filled Cookies",
    "image": "Raspberry Filled Cookies.png"
  },
  {
    "author": "Uncle Chris",
    "ingredients": [
      "6 oz package Raspberry Jell-O 2 cups boiling water",
      "2 cups pretzels",
      "1/4 cup sugar",
      "1 stick butter",
      "1 (8oz) package cream cheese – softened",
      "1 (8oz) package Cool Whip – thawed",
      "1 cup sugar",
      "1 bag frozen raspberries – thawed in refrigerator"
    ],
    "steps": [
      "Pre-heat oven to 350°F.",
      "1. Combine 6 oz packet of Jell-O with 2 cups of boil- ing water and set aside to cool to room temperature.",
      "2. Crush 2 cups of pretzels in a ziploc bag, using a roll- ing pin.",
      "3. Melt 1 stick of butter than add 1/4 cup sugar in saucepan. Add pretzels and mix together.",
      "4. Lightly press pretzel mix into a 13×9 -inch pyrex dish and bake for 10 minutes at 350°F, then cool to room temperature.",
      "5. While pretzel mix is cooling down, beat 8 oz of cream cheese and 1 cup sugar on medium/low speed until well-combined.",
      "6. Next, stir in Cool Whip using a spatula and mix until well combined.",
      "7. Spread mixture over cooled pretzels and go all the way to the edges of the dish to create a seal. You don’t want the jello to leak into the pretzels. Refrigerate 30 minutes.",
      "8. Place raspberries evenly on top of the cream filling..",
      "9. Pour Jell-O over raspberries and refrigerate until jello is set.",
      "Enjoy :D."
    ],
    "title": "Raspberry Thanksgiving Desert",
    "image": "Raspberry Thanksgiving Desert.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "2 cups all-purpose flour",
      "1 tablespoon sugar",
      "1 tablespoon baking powder",
      "2 teaspoons garlic powder",
      "1/2 teaspoon kosher salt",
      "1/4 teaspoon cayenne pepper, optional",
      "1 cup buttermilk",
      "1/2 cup unsalted butter, melted",
      "1 1/2 cups shredded sharp cheddar cheese FOR THE TOPPING",
      "3 tablespoons unsalted butter, melted",
      "1 tablespoon chopped fresh parsley leaves 1/2 teaspoon garlic powder"
    ],
    "steps": [
      "1. Preheat oven to 450 degrees F. Line a baking sheet with parchment paper or a silicone baking mat; set aside.",
      "2. In a large bowl, combine flour, sugar, baking pow- der, garlic powder, salt and cayenne pepper, if using.",
      "3. In a large glass measuring cup or another bowl, whisk together buttermilk and butter. Pour mixture over dry ingredients and stir using a rubber spatula just until moist. Gently fold in cheese.",
      "4. Using a 1/4-cup measuring cup, scoop the batter evenly onto the prepared baking sheet. Place into oven and bake for 10-12 minutes, or until golden brown.",
      "5. For the topping, whisk together butter, parsley and garlic powder in a small bowl. Working one at a time, brush the tops of the biscuits with the butter mixture.",
      "Serve immediately."
    ],
    "title": "Red Lobster Cheddar Bay Biscuits",
    "image": "RED LOBSTER CHEDDAR BAY BISCUITS.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "French Bread:",
      "3 cups flour 4 tsp. sugar",
      "11⁄4 cups hot water 2 Tbs. butter 1 pkg. yeast 11⁄2 tsp. salt",
      "Ingredients for Reuben:",
      "Thousand Island Dressing 2 TBSP. melted butter 16 oz jar Sauerkraut (drained) Caraway seeds",
      "1 lb. sliced Swiss cheese 1 lb. sliced corn beef"
    ],
    "steps": [
      "For the French Bread:",
      "Add butter to hot water. Beat in 1 cup flour, salt, sugar, undissolved yeast. Beat in second and third cups of flour (with electric beaters), one at a time. Let dough rest 10 min, stir 100 strokes.",
      "Repeat this set 5 more times.",
      "Turn onto heavily floured board and mold into 1 large loaf.",
      "Cover and let rise till doubled.",
      "Now let’s put the Reuben Loaf together...",
      "On the floured surface, roll out the dough.",
      "Spread a generous amount of Thousand Island Dressing in the center of the dough.",
      "Place a layer of meat down the center, a layer of cheese, then a layer of sauerkraut. I like to add a little more dressing at this point. (see photo 1) Make diagonal cuts down one side of the dough, then the other. Now your going to criss-cross these stripes over, fold the ends in. (see photo 2)",
      "Brush butter across the top and sprinkle with cara- way seeds.",
      "Bake in 450* oven for 25-30 minutes. Let stand for 5 minutes then slice and serve."
    ],
    "title": "Reuben Loaf",
    "image": "Reuben Loaf1.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "1 head garlic $0.59",
      "1⁄2 Tbsp olive oil $0.09",
      "1 lb. pasta shells $1.29",
      "15 oz. ricotta cheese $2.45",
      "1⁄4 cup grated parmesan $0.23 to taste salt & pepper $0.05",
      "1 pint cherry tomatoes $2.50 3 cups baby spinach $1.33"
    ],
    "steps": [
      "Using a sharp knife, cut approximately 1⁄2 inch off the top of the head of garlic. Place the garlic bulb in a small bowl or dish and drizzle 1⁄2 tablespoon of olive oil over the exposed cloves. Cover the bowl with an inverted plate. Microwave on high, in one minute increments, until the garlic is soft and fragrant (about 2 minutes). Use caution when touching the dishes, they will be very hot. Allow the garlic to cool.",
      "Bring a large pot of water to a rolling boil, add the pas- ta, and cook for 7-10 minutes or until al dente. Reserve 1⁄2 cup of the starchy pasta cooking water.",
      "While the pasta is cooking, squeeze the garlic cloves from the head and mince well. Add the minced garlic to a medium bowl along with the ricotta cheese, a healthy dose of freshly cracked pepper, and about 1⁄2 tsp of salt. Add the 1⁄2 cup of hot, starchy pasta cooking water. Stir until it forms a smooth sauce.",
      "Drain the pasta. Return the drained pasta to the warm pot (the burner should be turned off). Add the fresh baby spinach and pour the ricotta sauce over top. Slice the cherry tomatoes and add them to the pot as well. Stir until everything is well mixed. Add in the parmesan cheese and stir again. Taste and add salt and pepper to taste. Serve warm! serves 8"
    ],
    "title": "Roasted Garlic Pasta",
    "image": "Roasted Garlic Pasta.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "Cake:",
      "1 package yellow cake mix",
      "1 small instant vanilla pudding mix 4 eggs",
      "1/2 cup cold water",
      "1/2 cup rum",
      "1/2 cup vevetable oil",
      "Rum Glaze:",
      "1/4 lb (1 stick) butter 1/4 lb water",
      "1 cup sugar",
      "1/2 cup rum"
    ],
    "steps": [
      "Preheat oven 325 degrees F.",
      "Grease a bundt pan liberally with cooking spray. Then add a few tablespoons of granulated sugar to the inside of the pan, and gently tap and turn it around until every square inch of the inside of the pan is coated in sugar. Set aside.",
      "Mix pudding, cake mix, eggs water, rum and oil until smooth.",
      "Pour into pan and Bake 1 hour",
      "For Glaze:",
      "Melt butter in sauce pan and stir in the water and sugar. Boil for 5 minutes. Remove from heat and stir in the rum.",
      "Cool in pan for 25 minutes.",
      "Invert cake onto serving plate.",
      "Prick top and spoon and brush the rum glaze evenly over cake."
    ],
    "title": "Rum Cake",
    "image": "Rum Cake.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "4 chicken breasts",
      "Marinade:",
      "3 Tbsp fresh lemon juice 5 Tbsp olive oil",
      "28 sage leaves",
      "3 Tbsp butter",
      "salt and pepper"
    ],
    "steps": [
      "-Combine marinade and let chicken marinate for 1 hour.",
      "-Heat 2 Tbsp oil and 3 Tbsp butter in a skillet. -add chicken and cook for 5 - 7min. on each side. -Remove chicken.",
      "-add the fresh sage leaves to skillet and toast till crispy. Pour sage leaves and juices over the chicken."
    ],
    "title": "Sage Lemon Chicken",
    "image": "Sage Lemon Chicken.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "6-8 plum tomatoes, cored and diced",
      "1 jalapeño, seeded and finely chopped",
      "2-3 small cloves of garlic, minced (optional) 1 small white onion, skin removed and diced 1/2 bunch of cilantro, roughly chopped",
      "1 lime, juiced",
      "1/2 tsp salt"
    ],
    "steps": [
      "Combine diced tomatoes, jalapeño, garlic and onion in a medium bowl.",
      "Add lime juice and salt and stir coat vegetables",
      "Add in roughly chopped cilantro",
      "Taste to see if extra salt or lime juice is needed",
      "Set aside for at least 1/2 hour at room temperature to let ingredients meld together"
    ],
    "title": "Salsa Fresca",
    "image": "Salsa Fresca.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "1 pound bulk pork sausage",
      "1 cup coarsely chopped onion",
      "4 cups peeled potatoes cut in 1/2-inch cubes 2 cups water",
      "1 teaspoon salt",
      "1/8 teaspoon freshly ground pepper",
      "1 17 ounce can cream-style corn",
      "1 17 ounce can whole-kernel corn, drained",
      "1 12 ounce can evaporated milk"
    ],
    "steps": [
      "1. In a Dutch oven or kettle, cook the pork sausage and onion until the sausage is brown and the onion is tender. Drain mixture on paper towels.",
      "2. Return sausage mixture to Dutch oven. Stir in potatoes, water, salt, and pepper. Bring to boiling; reduce heat. Simmer, uncovered, about 15 minutes or until potato is just tender.",
      "3. Add the cream-style corn, whole-kernel corn, and the evaporated milk. Heat through. Makes 6 serv- ings."
    ],
    "title": "Sausage Corn Showder",
    "image": "Sausage Corn Showder.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "1 tablespoon olive oil",
      "1 pound spicy Italian sausage, casing removed",
      "3 cloves garlic, minced",
      "1 onion, diced",
      "1/2 teaspoon dried oregano",
      "1/2 teaspoon dried basil",
      "1/2 teaspoon crushed red pepper flakes, optional Kosher salt and freshly ground black pepper, to taste 5 cups chicken broth",
      "1 bay leaf",
      "1 pound red potatoes, diced",
      "3 cups baby spinach",
      "1/4 cup heavy cream"
    ],
    "steps": [
      "Heat olive oil in a large stockpot or Dutch oven over medium heat. Add Italian sausage and cook until browned, about 3-5 minutes, making sure to crum- ble the sausage as it cooks; drain excess fat.",
      "Stir in garlic, onion, oregano, basil and red pepper flakes. Cook, stirring frequently, until onions have become translucent, about 2-3 minutes; season with salt and pepper, to taste.",
      "Stir in chicken broth and bay leaf, and bring to a boil. Add potatoes and cook until tender, about 10 minutes.",
      "Stir in spinach until it begins to wilt, about 1-2 min- utes. Stir in heavy cream until heated through, about 1 minute; season with salt and pepper, to taste. Serve immediately."
    ],
    "title": "Sausage, Potato, Spinach Soup",
    "image": "Sausage, Potato, Spinach Soup.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "20 dry red chilies (sookhi lal mirch) less hot or medium hot. i added a mix of 15 kashmiri and 45 byadagi dry red chilies",
      "4 to 5 shallots Or 1 small onion finely chopped 15 garlic cloves (lahsun) finely chopped",
      "1 inch ginger (adrak) finely chopped",
      "2 to 2.5 tablespoon water for grinding the red chilies 1⁄2 cup water to be added later",
      "1 tablespoon rice vinegar or white vinegar or apple cider vinegar",
      "3 to 4 sichuan peppers, optional (skip if you don’t have)",
      "1⁄2 tablespoon finely chopped celery, optional (skip if you don’t have)",
      "1 to 2 teaspoon organic unrefined cane sugar or brown sugar please add as required. for a more sweeter taste, you can even add up to 3 teaspoon sugar.",
      "1⁄4 to 1⁄2 teaspoon black pepper powder (kali mirch powder) or as required",
      "1⁄2 teaspoon light soy sauce or as required",
      "3 to 4 tablespoon sesame oil or any vegetable oil",
      "salt as required"
    ],
    "steps": [
      "1. rinse and then soak the chilies in hot water for 30 minutes. 2. you can also deseed the chilies before you soak them.",
      "3. drain. remove the stems and then break the chilies. add them to a chutney grinder or blender. add water and make a smooth paste of the red chilies.",
      "4. crush the sichuan peppers coarsely in a mortarpestle. 5. heat sesame oil or any other vegetable oil in a pan.",
      "6. add the garlic and ginger first and saute till their raw aroma goes away. don’t brown them.",
      "7. add the chopped shallots and then saute them till translucent.",
      "8. add the ground red chili paste and stir.",
      "9. then add the crushed sichuan pepper. saute for 1 to 2 minutes more till you see oil from the sides of the sauce.",
      "10. add 1/2 cup of water and give a stir again. simmer for 2 mins.",
      "11. add salt, pepper, soy sauce and vinegar. also add celery now, if using.",
      "12. stir and continue to cook for 5 to 6 minutes more. 13. check the taste, and add more salt, sugar or pepper as required.",
      "14. once the schezuan sauce cools down collect it in a small jar or bowl.",
      "15. cover tightly with a lid and refrigerate.",
      "16. serve schezwan sauce as a condiment with snacks or",
      "you can also add in recipes like schezwan fried rice or noodles, vegetable schezwan or veg balls in hot garlic sauce.",
      "17. the sauce stays good for about 2 to 3 weeks in an air tight container in the refrigerator."
    ],
    "title": "Schezwan Sauce",
    "image": "Schezwan Sauce.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "• 2 cooked, skinless chicken breasts sliced",
      "• 1 med. yellow onion",
      "• 1 serrano chille sliced",
      "• 2 garlic cloves chopped",
      "• 1⁄2 red pepper sliced in strips • 2 tbs olive oil",
      "• 4 cups chicken broth",
      "• 1 med. yam (sliced in strips)",
      "• 15 oz. canned hominy drained • sliced cooked chicken breast",
      "• 14 oz unsweetened canned coconut milk/cream • 2 plum tomatoes sliced and seeded",
      "Toppings",
      "• 1/3 cup avocado sliced",
      "• Fresh squeezed lime juice • cilantro"
    ],
    "steps": [
      "Sauté in a soup pot for 5-10 min:",
      "onion, serrano chille sliced, garlic, red pepper in the olive oil",
      "Add to soup pot and cook on med just till boiling:",
      "chickens broth, yam, hominy, chicken breast",
      "Add to soup pot and serve:",
      "coconut milk and plum tomatoes salt and pepper to taste",
      "Don’t forget the yummy toppings on the side:",
      "avacado, lime and cilantro"
    ],
    "title": "Souper Yammy Soup",
    "image": "SOUPER YAMMY SOUP.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "For the Sauce (1 month supply):",
      "2 (6 lb 6 oz) cans whole peeled tomatoes",
      "8 tablespoons extra-virgin olive oil",
      "24 to 32 cloves minced garlic (about 2 tablespoons) 1 (24 ounce) can tomato paste",
      "1 Tbsp Kosher salt",
      "1 Tbspfreshly ground black pepper",
      "For the Meatballs (3 large dinners): 16 slices bread, crusts removed",
      "8 eggs",
      "8 lb 80/20 ground beef",
      "1/3 cup adobo seasoning (such as Goya), see note above",
      "2 cups minced fresh parsley leaves",
      "Kosher salt and freshly ground black pepper Olive oil for frying",
      "Pasta and grated Parmesan cheese for serving"
    ],
    "steps": [
      "1. For the Sauce: Crush tomatoes with blender. Heat oil in a large Dutch oven over medium heat until shimmer- ing. Add garlic and cook, stirring, until softened but not browned, about 1 minute. Add tomato paste and",
      "cook, stirring, until fragrant, about 1 minute longer. Add crushed tomatoes, bring to a simmer, cover, and reduce heat to low. Season lightly with salt and pepper. Mean- while, make the meatballs.",
      "2. For the Meatballs: Tear bread into rough chunks and pulse in the food processor until reduced to fine crumbs. Transferto a large bowl. Add the eggs and mix with your hands until combined. Add beef, adobo seasoning, and half ofthe parsley. Combine mixture with your hands, working the bread crumbs into the meat until meat mix- ture can form a ball that holds together when tossed back into the bowl. Do not over mix.",
      "3. Place a small amount of mixture on a microwave-safe plate and microwave on high until cooked, about 20 seconds. Taste and add salt and/or pepperto mixture",
      "to taste. Using wet hands, form the mixture into balls roughly 2 tablespoons each, about 1 1/2- 2-inches across. Place the balls on a large cookie sheet. and bake 350 degree oven for 15 min. add to the sauce.",
      "5. Simmer overlow heat for 1 hour. Season to taste with salt and pepper and stirin remaining"
    ],
    "title": "Spaghetti and Meatballs",
    "image": "Spaghetti and Meatballs.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "Beef:",
      "2 tsp soy sauce",
      "1/4 tsp sugar",
      "1/4 tsp salt",
      "3/4 pound boneless sirloin, but across the grain into 1/4” thick slices",
      "Sauce:",
      "1 Tbsp cornstarch",
      "1 Tbsp soy sauce",
      "1 Tbsp medium-dry Sherry or Scotch",
      "1/4 cup chicken or beef broth or water",
      "1 tsp sugar",
      "2 tsp Oriental sesame oil",
      "3 Tbsp vegetable oil",
      "1 Tbsp minced peeled fresh gingerroot",
      "1 Tbsp minced garlic",
      "a 4-inch fresh red chili, seeded and minced (wearing gloves)",
      "1 lb broccoli, cut into flowerets and the stems removed and cut into 1/2 inch thick sticks"
    ],
    "steps": [
      "Prepare beef:",
      "In a small bowl stir together the soy sauce, sugar, salt and beef and let it marinate for 20 minutes.",
      "Make the sauce while the beef is marinating:",
      "In a small bowl dissolve the cornstarch in the soy sauce and stir in the Sherry, the broth, the sugar, and the sesa- me oil.",
      "Cook meat and broccoli:",
      "Heat wok or large heavy skillet over high heat until it",
      "is hot, add 2 Tbsp of the vegetable oil, and heat it un-",
      "til it just begins to smoke. Stir-fry the beef in the oil in small batches for 1 minute, or until it is no longer pink, and transfer it as it is cooked with a slotted spoon to a plate. Add the remaining 1 Tbsp of vegatable oil to the wok, heat it until it is hot but not smoking, and in the",
      "oil stir-fry the gingerroot, the garlic, and the chili for 30 seconds, or until the mixture is fragrant. Add the broc- coli and stir-fry the mixture for 1 minute. Add 1/3 cup water and steam the broccoli, covered, for 1 to 2 min. Stir in sauce, add it to the wok with the beef and any broth that has accumulated on the plate, and cook the mixture, stirring for 2 minute, or until the sauce is thickened and the beef is heated through.",
      "Serve with rice. Makes 2 servings."
    ],
    "title": "Stir-Fried Beef and Broccoli",
    "image": "Stir-Fried Beef and Broccoli.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "Shell Filling:",
      "30 oz Ricatta cheese",
      "12 oz Mozzarella cheese 1/2 cup Parmesan cheese 2 eggs",
      "1 Tbsp Chopped parsley 1 tsp salt",
      "1/4 tsp pepper",
      "Cheese Sprinkle:",
      "3 Tbsp Parmesan cheese 4 oz Mozzarella cheese",
      "Sauce:",
      "1/4 cup olive oil",
      "1 cup onion chopped 1 clove garlic chopped",
      "2 lb can whole tomatoes 6 oz can tomatoe paste 8 oz can tomatoe sauce 2 Tbsp Parsley",
      "1 - 2 Tbsp sugar 1 tsp Oragano 1/2 tsp basil",
      "1/4 tsp pepper"
    ],
    "steps": [
      "For Sauce:",
      "-Saute onion and garlic in olive oil until tender. -add other sauce ingredients and cook for 1 hour.",
      "For Filling:",
      "-Mix ricatta, Mozzarella and parmesan cheese, eggs, parsley, salt and pepper.",
      "For Shells:",
      "-Boil according to pachage directions. -Fill with cheese filling",
      "-Pour a layer of sauce into a 9x14” casserole dish -add stuffed shells",
      "-sprinkle with parmesan mozzarella mix",
      "-cover with remaining sauce",
      "-Bake in 350 degree oven for 45 - 50 min."
    ],
    "title": "Stuffed Shells",
    "image": "Stuffed Shells.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "1 pound thin spaghetti",
      "4 tablespoons oriental sesame oil , divided",
      "1 cup julienned carrots",
      "2 cups napa cabbage , sliced",
      "2 cups chopped , cooked chicken breast meat 8 green onions , chopped",
      "5 garlic cloves , minced",
      "1 tablespoon minced peeled fresh ginger 1/4 cup honey",
      "1/4 cup creamy peanut butter",
      "1/4 cup soy sauce",
      "3 tablespoons unseasoned rice vinegar",
      "1 1/2 tablespoons chili-garlic sauce"
    ],
    "steps": [
      "1. Bring a pot of water to boil.",
      "2. Add 1-2 tbsp of salt to season the water.",
      "3. Cook pasta, al dente (I shoot for a minute shy of what the box says)",
      "4. Drain pasta and toss with 2 tbsp sesame oil.",
      "5. Pat dry the inside of the pot and add 1 tbsp of sesame oil.",
      "6. If you would like to add some green onions as a garnish at the end, reserve 1/4 cup of them before putting the rest in the pan.",
      "7. Add the green onions, carrots, napa cabbage, chicken, garlic and ginger.",
      "8. Saute for a minute or two until they have softened and barely start to turn color.",
      "9. Add in the honey, peanut butter, soy sauce, vine- gar and Sriracha.",
      "10. Stir all the ingredients together and add the pas- ta back into the pot.",
      "12. Toss the pasta with the rest of the ingredients and serve!",
      "13. Garnish with remaining green onions if you chose to reserve some"
    ],
    "title": "Thai Chicken Pasta",
    "image": "Thai Chicken Pasta.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "1 tbsp olive oil",
      "1 medium onion, diced",
      "2 cloves garlic, sliced",
      "1 tbsp ginger, peeled & diced into small pieces",
      "1 tbsp Thai red curry paste (My favorite curry paste) 1 medium sweet potato {500g}, peeled and diced into 1⁄2 inch cubes",
      "2 medium carrots, peeled and diced",
      "3 cups stock {veggie or chicken}",
      "3⁄4 cup dried red lentils",
      "1 tbsp fish sauce",
      "1 tbsp lime juice",
      "After simmering:",
      "1 can coconut milk {400mL}",
      "1⁄4 tsp salt {or more; to taste}",
      "1 tsp lime juice",
      "1 tsp fish sauce"
    ],
    "steps": [
      "Heat olive oil in a large saucepan over medium heat. Add the onion and cook, stirring occasionally, until translucent and cooked through. Add the garlic and ginger, and cook for a minute.",
      "Add the curry paste and cook until onions/garlic/ ginger are coated and you can smell the curry paste, 30 seconds-1minute.",
      "Add the sweet potato, carrots, stock, lentils, fish sauce and lime juice. Cover, bring to a boil, reduce heat, and simmer for 20 minutes, until lentils and sweet potato are cooked through.",
      "Using an immersion blender, puree the soup until smooth and creamy. Stir in the coconut milk. Add salt and additional lime juice and fish sauce to taste."
    ],
    "title": "Thai Curry Sweet Potato Lentil Soup",
    "image": "Thai Curry Sweet Potato Lentil Soup.png"
  },
  {
    "author": "Jamie Oliver",
    "ingredients": [
      "1 x 1.6 kg whole free-range chicken 1 butternut squash (1.2kg)",
      "1 bunch of fresh coriander (30g) 100 g Thai red curry paste",
      "1 x 400 ml tin of light coconut milk"
    ],
    "steps": [
      "Sit the chicken in a large, deep pan. Carefully halve the squash lengthways, then cut into 3cm chunks, discarding the seeds. Slice the coriander stalks, add to the pan with the squash, curry paste and coconut milk, then pour in 1 litre of water. Cover and sim- mer on a medium heat for 1 hour 20 minutes.",
      "Use tongs to remove the chicken to a platter. Spoon any fat from the surface of the soup over the chick- en, then sprinkle with half the coriander leaves. Serve with 2 forks for divvying up the meat at the table. Use a potato masher to crush some of the squash, giving your soup a thicker texture. Taste, season to perfection with sea salt and black pepper, then divide between six bowls and sprinkle with the remaining coriander. Shred and add chicken, as you dig in."
    ],
    "title": "Thai red chicken soup",
    "image": "Thai red chicken soup.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "Sift together in a large bowl:",
      "1 3/4 cups sifted all-purpose flour 2 teaspoons baking powder",
      "1 tablespoon sugar",
      "1/2 teaspoon salt",
      "1/4 cup cold butter",
      "2 eggs beaten (reserving 2 Tbsp for spreading on the scones before baking)",
      "1/3 cup cream",
      "1/3 cup raisins, currants or cranberries (optional)"
    ],
    "steps": [
      "1. Preheat oven to 350 degrees F.",
      "2. Sift together in a large bowl, the flour, baking powder, sugar, and salt.",
      "3. Cut into these ingredients, until the size of small peas, the butter.",
      "4. Add dry fruits. (optional)",
      "5. Make a well in the dry ingredients. Pour the liq- uid into it. Combine with a few swift strokes. Han- dle the dough as little as possible, or it will be tough.",
      "6. Place on a lightly floured board. Pat into a 3/4-",
      "1 inch thick circle. Cut into 2 inch rounds or pie shaped wedges. Brush with the reserved beaten egg and sprinkle with sugar.",
      "7. Place on a greased or nonstick baking sheet and bake for about 15 minutes or until golden brown. Makes 12 scones. Serve with whipped unsalted but- ter and jam."
    ],
    "title": "The Joy of Cooking Scones",
    "image": "The Joy of Cooking Scones.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "2 cups plain Greek yogurt",
      "optional - 1/2 cup sour cream",
      "2 cucumbers, peeled and seeded, minced 1 Tbsp kosher salt (not table salt)",
      "1 Tbsp champagne vinegar",
      "(can use white wine vinegar)",
      "2 Tbsp freshly squeezed lemon juice (about 1 large lemon)",
      "1 Tbsp extra virgin olive oil",
      "2 tsp minced fresh garlic",
      "1 1/2 - 2 tsp minced fresh dill",
      "fresh ground black pepper"
    ],
    "steps": [
      "The only imperative in this recipe is to remove LOTS of the liquid from the cucumbers so the final dip will be nice and thick. Cut the cucumbers and then mince them really, really fine.",
      "Put the salted cucumbers in a fine strainer over a bowl. Just let it hang out a while, while you are working on the other ingre- dients. I think I let mine drain for probably 20 minutes or so.",
      "While the cucumbers are draining, let’s get on with the rest. Into a bowl, add your plain, Greek yogurt. Next I added the sour cream, add the rest of the seasonings: champagne vine- gar, lemon juice, olive oil, garlic, dill, and pepper.",
      "Pour out the minced, salted cucumbers onto a clean tea towel. Gather it up and SQUEEZE!!!! And then squeeze HARDER! You can see how much more of the liquid is coming out. After you can no longer squeeze out any liquid from the cucumbers, add the cucumber “pulp” (well that’s what it looks like to me at this point) into the yogurt mixture. Now mix to combine. Taste and adjust any seasonings. More dill? Pepper? Salt?",
      "It’s best if you let the flavors marry for several hours or even overnight. If you are making it for a party, I would suggest making it the day before. Serve as you wish. I served it with pita bread triangles, sliced cucumbers, and strips of sweet yellow and red bell peppers."
    ],
    "title": "Tzatziki",
    "image": "Tzatziki.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "5 cups peeled, chopped all-pupose potatoes",
      "3 cups thinly sliced leeks (use the white and 2 inches of the green)",
      "1 2/3 cup chicken broth",
      "5 cups water",
      "1 teaspoon salt",
      "1/2 tsp pepper (white if you want to stay white)",
      "1/2 cup heavy cream",
      "chopped chives (optional)"
    ],
    "steps": [
      "1. In soup pot, add the potatoes, leeks, broth, water, salt, and pepper. Simmer for 1 hour.",
      "2. Puree the soup and pour it into a large bowl. Stir in the cream. Serve warm or cold.",
      "Makes 6 - 8 servings"
    ],
    "title": "Vichyssoise",
    "image": "Vichyssoise.png"
  },
  {
    "author": "Dana Dirksen",
    "ingredients": [
      "FOR THE YUMM SAUCE:",
      "1/2 cup water",
      "1/2 cup fresh lemon juice",
      "1/2 cup grape seed or canola oil",
      "1/2 cup almond meal or finely chopped almonds 1/3 cup nutritional yeast",
      "1/2 cup cooked garbanzo beans",
      "1/4 cup cooked soybeans or 1/3 cup tofu",
      "1-2 garlic cloves, minced or pressed",
      "1/2 teaspoon salt",
      "1 1/2 teaspoons curry powder",
      "1 teaspoon dried oregano",
      "1 teaspoon dried cilantro",
      "FOR THE ORIGINAL YUMM BOWL:",
      "Brown rice, cooked",
      "Black beans, cooked",
      "Shredded cheddar cheese",
      "Salsa",
      "Diced fresh tomato, Sliced fresh avocado Sliced black olives, Sour cream",
      "Fresh cilantro sprigs"
    ],
    "steps": [
      "FOR THE YUMM SAUCE:",
      "1. Add all ingredients to a blender and blend till smooth.",
      "4. Transfer the sauce to a clean bottle or jar, cover, and refrigerate overnight to allow the flavors to blend.",
      "TO ASSEMBLE THE YUMM BOWL:",
      "1. Place a scoop of brown rice in an individual-sized serving bowl, then layer a scoop of black beans over the rice. Drizzle the rice and beans with a desired amount of Yumm Sauce, then sprinkle shredded cheddar cheese over the rice.",
      "2. Spoon a dollop of salsa in the middle of the bowl, then spoon the tomato, avocado, and olives around the perimeter. Place a dollop of sour cream in the center of the bowl, garnish with some cilantro sprigs, and serve"
    ],
    "title": "Yumm Bowl and Sauce",
    "image": "Yumm Bowl and Sauce.png"
  },
  {
    "title": "Stephanie's Best Fondue",
    "author": "Stephanie Maciel",
    "image": "stephanies_best_fondue.jpg",
    "serves": 8,
    "prep_minutes": 30,
    "ingredients": [
      "1 cup Emmentaler",
      "½ cup Grand Cru",
      "⅓ cup Jarlsberg",
      "¼ cup Butterlease",
      "Garlic clove",
      "Nutmeg",
      "Hirsch or cherry brandy",
      "1 tsp cornstarch",
      "¼ cup heavy cream"
    ],
    "steps": [
      "Rub 1 clove of garlic around a medium saucepan, then discard.",
      "Add 1 ½ cups of uncooked Chardonnay wine and bring to a boil on med high heat.",
      "Turn down head to low med and add cheeses, stirring constantly until melted.",
      "Stir in heavy cream",
      "Stir in ½ tsp fresh grated nutmeg and 2 tsp Hirsh or cherry brandy."
    ],
    "tips": [
      "Best served with apples, baked kielbasa, cubes of pumpernickel and french breads."
    ],
    "tags": [
      "appetizers",
      "cheese"
    ]
  },
  {
    "title": "Steamed Eggs",
    "author": "Dana Dirksen",
    "image": "blank.jpg",
    "serves": 8,
    "prep_minutes": 20,
    "ingredients": [
      "Eggs",
      "Chicken broth",
      "Fish sauce",
      "Green onion",
      "Sesame oil"
    ],
    "steps": [
      "Add 1½ cups of chicken broth to a 3 cup earthenware bowl. Boil over medium high heat.",
      "Add 3 cracked eggs and 1 egg yolk to a bowl.",
      "Add 1 ts fish sauce and 2 tbsp chopped green onion to the eggs. Beat well",
      "When the chicken broth starts boiling, lower the heat to a simmer",
      "Add the egg mixture to the simmering broth and stir it well with a fork well for 10 seconds",
      "Close the lid and simmer another 4-5 minutes until the egg mixture sizzles and has a texture like soft tofu",
      "Open the lid and turn off the heat. Drizzle 2 ts sesame oil and sprinkle 1 tbsp chopped green onion over top.  Serve hot as a side dish with rice"
    ],
    "tips": [],
    "tags": [
      "entrees",
      "bowl"
    ]
  },
  {
    "title": "Spinach Side Dish",
    "author": "Dana Dirksen",
    "image": "spinach_side_dish.jpg",
    "serves": 4,
    "prep_minutes": 20,
    "ingredients": [
      "8 ounces spinach, cleaned and washed",
      "1 garlic clove, minced",
      "1 green onion, chopped",
      "1½ teaspoon soy sauce",
      "1½ teaspoon sesame oil",
      "2 teaspoon sesame seeds",
      "Korean dried shredded red pepper, optional"
    ],
    "steps": [
      "Boil 8 to 10 cups of water in a large pot.",
      "Blanch the spinach for 30 seconds to 1 minute with lid off, stirring with a wooden spoon.",
      "Strain the spinach and rinse in cold water a couple of times to remove any residual dirt.",
      "Squeeze out excess water and cut a few times into bite size pieces.",
      "Mix the spinach with garlic, green onion, soy sauce, sesame oil, and sesame seeds in a mixing bowl by hand.",
      "Transfer to a bowl or plate and garnish with shredded red pepper, if used.",
      "Serve with rice."
    ],
    "tips": [],
    "tags": [
      "appetizers"
    ]
  },
  {
    "title": "Spicy Soft Tofu Soup with Seafood",
    "author": "Dana Dirksen",
    "image": "spicy_soft_tofu_soup_with_seafood.jpg",
    "serves": 3,
    "prep_minutes": 30,
    "ingredients": [
      "12 dried anchovies",
      "⅓ cup of kelp",
      "half onion",
      "5 cloves of garlic",
      "3 shiitake mushrooms",
      "100 grams of beef",
      "1 cup of frozen mixed seafood",
      "3 shrimp",
      "2 green onions ",
      "1 green chili pepper",
      "2-5 tbsp of hot pepper flakes",
      "olive oil",
      "sesame oil",
      "2 tubes soft tofu",
      "2 tbsp fish sauce",
      "2 eggs"
    ],
    "steps": [
      "Pour 5 cups of water into a pot and add 12 dried anchovies after removing intestine part.",
      "Add half onion, some dried kelp (about ⅓ cup), 3 dried shiitake mushrooms, 5 cloves of garlic and boil it over high heat.",
      "Approximately 10 minutes later, lower the heat to low medium heat and boil it for another 20 minutes.",
      "Set aside the stock and take out the mushrooms and chop them into small pieces.",
      "Heat your earthenware (or ceramic pot) on the stove and put 2 ts of olive oil.",
      "Chop 100 grams of beef and put it into the pot and stir it.",
      "Add the chopped shiitake mushroom and stir it.",
      "Add 2 tbsp – 5 tbsp (¼ cup) of hot pepper flakes and keep stirring for 1 minute.",
      "Pour 2 cups of the stock you made. It will be sizzling. Don’t be afraid! It’s just TOFU stew! : )",
      "Add 1 cup of mixed seafood and 3 shrimp.",
      "Add 2 tbsp of fish sauce.",
      "Cut the 2 tubes of Soon soft tofu in half and squeeze it out into the pot and break the tofu with a spoon several times in the pot.",
      "When it boils, add 2 chopped green onions and 1 green chili pepper.",
      "Crack eggs and drizzle some sesame oil before serving."
    ],
    "tips": [],
    "tags": [
      "entree"
    ]
  },
  {
    "title": "Spicy Korean Fried Chicken",
    "author": "Dana Dirksen",
    "image": "spicy_korean_fried_chicken.jpg",
    "serves": 4,
    "prep_minutes": 20,
    "ingredients": [
      "6 chicken thighs cut into 2 inch pieces, or 10 chicken legs",
      "½ tsp salt",
      "½ tsp pepper",
      "1 tsp ginger, minced",
      "⅔ cup corn starch",
      "4 garlic cloves, minced",
      "2 tbsp sesame oil",
      "1 tbsp red pepper flakes",
      "¼ soy sauce",
      "½ cup sugar",
      "½ cup syrup",
      "1 tbsp vinegar",
      "1 tbsp brown sugar",
      "1 tbsp hot mustard",
      "1 tbsp sesame seeds"
    ],
    "steps": [
      "Cut off the tip of each wing and chop the wing in half. After this is done you should have about 3 pounds of chicken, with 24 to 26 pieces.",
      "Put the chicken in a bowl and mix with salt, ginger, and ground black pepper by hand.",
      "Put 2/3 cup potato starch in a bowl and dip each wing in the powder to coat it, one by one. Squeeze each wing to press the coating to it tightly.",
      "For the sauce: heat a large non-stick skillet or wok over medium high heat. Add 2 tablespoons cooking oil, minced garlic, and the dried red chili pepper.",
      "Stir with a wooden spoon until fragrant for about 30 seconds.",
      "Add soy sauce, rice syrup, vinegar, and mustard sauce (optional). Stir with a wooden spoon and let it bubble for a few minutes.",
      "Add the brown sugar and continue stirring. Remove from the heat. Set aside.",
      "Fry the chicken-Put 4 cups of cooking oil in a frying pan or pot and heat it up for 7 to 8 minutes over high heat.",
      "See if the oil’s ready by dipping a test wing into it. If the oil bubbles, it’s hot enough to start frying. Slide the coated wings one by one into the hot oil and cook for about 12 to 13 minutes, turning over a few times with tongs.",
      "Take the wings out of the oil and shake them off in a strainer. Turn off the heat, and let the wings sit for a few minutes.",
      "Reheat the oil and fry the wings again for another 12 to 15 minutes until they all look golden brown and feel super crunchy through the tongs. If your frying pan or pot is not large enough to fry all the chicken at once, divide it into batches like I do in the video. If you use a larger frying pot to cook them all at once, you’ll have to use more cooking oil.",
      "When the chicken is done, reheat the sauce until it bubbles.",
      "Add the hot chicken and mix well with a wooden spoon to coat."
    ],
    "tips": [],
    "tags": [
      "entree"
    ]
  },
  {
    "title": "Asian Skewers",
    "author": "Dana Dirksen",
    "image": "Asian_skewers.jpg",
    "serves": 0,
    "prep_minutes": 300,
    "ingredients": [
      "1 pound beef sirloin tip roast",
      "1/3 cup reduced-sodium soy sauce",
      "1/4 cup sugar",
      "1/2 teaspoon ground ginger",
      "1 cup water",
      "4 medium carrots, julienned",
      "1/2 pound fresh green beans, trimmed",
      "1 large sweet red pepper, julienned",
      "1/2 cup reduced-fat sour cream",
      "2 tablespoon Dijon mustard",
      "1-1/4 teaspoons prepared horseradish"
    ],
    "steps": [
      "Cut beef widthwise into 16 slices, 1/4 in. thick. In a large resealable plastic bag, combine the soy sauce, sugar and ginger; add beef. Seal bag and turn to coat; refrigerate for 4 hours.",
      "In a large saucepan, bring water and carrots to a boil. Reduce heat; cover and simmer for 3 minutes. Add the beans and red pepper; cover and simmer for 3-5 minutes or until vegetables are crisp-tender. Drain and immediately place vegetables in ice water. Drain and pat dry.",
      "Drain and discard marinade from beef. Arrange three beans, one carrot strip and one pepper strip down the center of each beef slice; roll up. For each kabob use metal or soaked wooden skewers and thread two bundles on two parallel skewers.",
      "If grilling the kabobs, coat grill rack with cooking spray before starting the grill. Grill kabobs, covered, over medium heat or broil 4-6 in. from the heat for 3-5 minutes on each side or until beef reaches desired doneness.",
      "In a small bowl, combine the sour cream, mustard and horseradish. Serve with"

    ],
    "tips": [],
    "tags": [
      "entree"
    ]
  },
  {
    "title": "Kalbi BBQ Hawaiian Marinade",
    "author": "Dana Dirksen",
    "image": "blank.jpg",
    "serves": 0,
    "prep_minutes": 0,
    "ingredients": [
      "5 lbs thin cut tender short rib of beef, cross cut, about 1/2 inch thick (can substitute chuck steak)",
      "2 cups soy sauce (I use 1/2 aloha brand and 1/2 yamasa brand.)",
      "2 cups white sugar",
      "4 garlic cloves (pressed or chopped fine)",
      "1 inch ginger, grated",
      "1 teaspoon toasted sesame oil",
      "sliced green onion (optional)",
      "sesame seed, toasted until they pop and turn light brown (optional)",
      "1 little red pepper paste (optional) or red chile (optional)"
    ],
    "steps": [
      "Place ribs in a glass dish or a Tupperware marinator. ",
      "Mix all ingredients except for the optional ones in a pan and warm until the sugar melts, then cool.",
      "Pour marinade over ribs, add optional ingredients if you like, and place in the refrigerator 4 hours or overnight, mixing up occasionally to make sure all ribs are covered with sauce",
      "Grill or broil until sizzling, being careful not to burn because of the sugar. "
    ],
    "tips": [],
    "tags": [
      "entree"
    ]
  },
  {
    "title": "Chinese Spicy Chicken",
    "author": "Dana Dirksen",
    "image": "Chinese_spicy_chicken.jpg",
    "serves": 0,
    "prep_minutes": 0,
    "ingredients": [
      "1 chicken breast",
      "3 tbs flour",
      "1 egg yolk",
      "1 tbs of water",
      "1 tbs soy sauce",
      "1 teaspoon of sugar",
      "2 cloves of garlic",
      "2 tbs soy sauce",
      "1 tbs of rice cooking wine",
      "2 hot chili peppers",
      "scallion",
      "pinch of salt and pepper"
    ],
    "steps": [
      "Cut chicken breast into bite size chunk",
      "marinade with egg yolk, flour , water, soy sauce for 15 minutes",
      "deep fried until firm, and golden brown (but don't overcook)",
      "sauté garlic and chili pepper with low heat until fragrant add sugar (to caramelize)",
      "add soy sauce, the wok should be smoky at this moment,",
      "when it's fragrant, salt & pepper, scallions, wine, add chicken, cook until the chicken absorbs all the juice, serve"
    ],
    "tips": [],
    "tags": [
      "entree"
    ]
  },
  {
    "title": "Clam Chowder",
    "author": "Dana Dirksen",
    "image": "blank.jpg",
    "serves": 0,
    "prep_minutes": 0,
    "ingredients": [
      "3 cans minced clams (6.5 oz)",
      "1 cup minced onion",
      "1 cup diced potatoes",
      "¾ cup butter",
      "2 cups milk, evaporated milk, or half and half",
      "Dash of pepper",
      "Dash of salt",
      "1/3 cup bacon",
      "¾ cup all purpose flour (add more for creamy texture)",
      "1 Tsp olive oil?",
      "A tsp red pepper flakes",
      "Smoked cheddar cheese (for smoky flavor)"
    ],
    "steps": [],
    "tips": [],
    "tags": [
      "entree"
    ]
  },
  {
    "title": "Oyster Stew",
    "author": "Dana Dirksen",
    "image": "Oyster_stew.jpg",
    "serves": 0,
    "prep_minutes": 0,
    "ingredients": [
      "1 pint oysters",
      "1 medium onion",
      "2 stalks celery",
      "3 tbsp. vegetable shorting",
      "Sauce pan",
      "1 quart milk",
      "1 can cream of mushroom soup",
      "1 tsp. salt",
      "Large soup bowl",
      "1/2 tsp. paprika",
      "1 tsp. parsley"
    ],
    "steps": [
      "Remove the oysters from their shells. Check each oyster for small shell pieces.",
      "Chop the onion and celery into small cubes.",
      "Melt vegetable shortening in a sauce pan over high heat.",
      "Reduce the heat to medium. Add the oysters and their juices to the melted shortening. Stir the contents while adding the onion and celery.",
      "Cook until the edges of the oysters began to curl up. This usually takes about 3 minutes.",
      "Add the milk, salt and cream of mushroom soup to the oysters. Stir occasionally while continuing to cook over medium heat.",
      "Bring the stew to a boil.",
      "Remove from heat and pour into soup bowls.",
      "Sprinkle parsley and paprika on the top."
    ],
    "tips": [],
    "tags": [
      "entree"
    ]
  },
  {
    "title": "Irish Potato Farls",
    "author": "Dana Dirksen",
    "image": "Irish_potato_farls.jpg",
    "serves": 0,
    "prep_minutes": 0,
    "ingredients": [
      "1.25 lbs of Potatoes (4 potatoes)",
      "2 Teaspoons of Melted Butter",
      "1 Cup of Flour",
      "Half Teaspoon of Salt",
      "4 Teaspoons of Vegtable Oil"
    ],
    "steps": [
      "Peel and half the potatoes and boil in water for 20 minutes  or so until soft.",
      "Drain and then add the butter and mash thoroughly.",
      "Add the flour and slat and mix",
      "Divide the mixture in half and put the first half on a lightly floured surface",
      "Knead until flat - approx .25 inch thick.",
      "Divide into 4. Repeat the process for the other half of the mixture.",
      "Fry/Griddle using the oil for approx 2 minutes or until crispy brown on each side. Serve warm."
    ],
    "tips": [],
    "tags": [
      "appetizers"
    ]
  },
  {
    "title": "Red Velvet Cake",
    "author": "Dana Dirksen",
    "image": "red_velvet_cake.jpg",
    "serves": 0,
    "prep_minutes": 0,
    "ingredients": [
      "Vegetable oil for the pans",
      "2 1/2 cups all-purpose flour",
      "1 1/2 cups sugar",
      "1 teaspoon baking soda",
      "1 teaspoon fine salt",
      "1 teaspoon cocoa powder",
      "1 1/2 cups vegetable oil",
      "1 cup buttermilk, at room temperature",
      "2 large eggs, at room temperature",
      "2 tablespoons red food coloring (1 ounce)",
      "1 teaspoon white distilled vinegar",
      "1 teaspoon vanilla extract"
    ],
    "steps": [],
    "tips": [],
    "tags": [
      "desert"
    ]
  },
  {
    "title": "Vanilla Frosting",
    "author": "Dana Dirksen",
    "image": "vanilla_frosting.jpg",
    "serves": 0,
    "prep_minutes": 0,
    "ingredients": [
      "3 Cups powdered sugar",
      "1 1/2 Tsp Vanilla",
      "2 TBS Milk",
      "1/3 cup softened butter",
      "In a mixing bowl, combine the softened butter with the powdered sugar.",
      "Mix them together using a mixing spoon or electric mixer set on low speed until they are well blended.2",
      "Add the vanilla extract and one teaspoon of the milk and mix well.",
      "Scrape the sides of the bowl often while mixing.3",
      "Continue to add milk one teaspoon at a time until frosting is the desired consistency.4",
      "Blend until the icing is smooth and creamy with no lumps.5",
      "Frost your cake, cupcakes or desert, or refrigerate to use later."
    ],
    "steps": [],
    "tips": [],
    "tags": [
      "desert"
    ]
  },
  {
    "title": "Raspberry Martini",
    "author": "Dana Dirksen",
    "image": "raspberry_martini.jpg",
    "serves": 2,
    "prep_minutes": 5,
    "ingredients": [
      "1 ½ shots vodka",
      "1 shot triple sec",
      "1 shot lime juice",
      "1 scoop raspberry sorbet",
      "¼ cup cranberry or cran-raspberry juice"
    ],
    "steps": [
      "Place all ingredients into a cocktail shaker and shake until combined.",
      "Place a scoop of sorbet into glass for garnish"
    ],
    "tips": [],
    "tags": [
      "Drink",
      "alcoholic"
    ]
  },
  {
    "title": "Noodles with Black Bean Sauce",
    "author": "Dana Dirksen",
    "image": "noodles_with_black_bean_sauce.jpg",
    "serves": 3,
    "prep_minutes": 30,
    "ingredients": [
      "wheat noodles",
      "½ pound pork belly, cut into ½ inch cubes (about 1½ cups’ worth)",
      "1 cup of Korean radish (or daikon), cut into ½ inch cubes (about 1 cup’s worth)",
      "1 cup of zucchini, cut into ½ inch cubes",
      "1 cup of potato, peeled and cut into ½ inch cubes",
      "1½ cups of onion chunks",
      "3 Tablespoons of vegetable oil",
      "¼ cup and 1 Tablespoon of black bean paste",
      "2 Tablespoons of potato starch powder, combined with ¼ cup water and 1 teaspoon of sugar in a small bowl, set aside",
      "1 teaspoon of sesame oil",
      "½ cup cucumber, cut into thin matchsticks for garnish",
      "Water"
    ],
    "steps": [
      "stir-fry the pork belly in a large, deep wok with 1 Tablespoon of vegetable oil for about 4-5 minutes, until golden brown and crispy.",
      "Pour out the excess pork fat.",
      "Add radish and stir fry for 1 minute.",
      "Add potato, onion, and zucchini and keep stirring for about 3 minutes until the potato looks a little translucent.",
      "Clear a space in the center of the wok by pushing the ingredients to the edges.",
      "Add 2 Tablespoons of vegetable oil to the center of the wok, then add ¼ cup of black bean paste and stir it with a wooden spoon for 1 minute to fry it. Then mix everything in the wok and keep stirring.",
      "Add  2 cups of water to the wok and let it cook with the lid closed for about 10 minutes.",
      "Open the lid and taste a sample of the radish and potato. If they’re fully cooked, stir in the starch water little by little. Keep stirring until it’s well mixed and thick.",
      "Add the sesame oil and remove from the heat.",
      "Serve with noodles (jjajangmyeon) or steamed rice (jjajangbap).",
      "Garnish with cucumber strips on top of the jjajang sauce and serve it with kimchi or yellow pickled radish."
    ],
    "tips": [],
    "tags": [
      "entree"
    ]
  },
  {
    "title": "Kimchi Fried Rice",
    "author": "Dana Dirksen",
    "image": "kimchi_fried_rice.jpg",
    "serves": 3,
    "prep_minutes": 20,
    "ingredients": [
      "3 bowls steamed rice (3 cups)",
      "1 cup chopped kimchi",
      "¼ cup kimchi juice",
      "¼ cup water",
      "2-3 tablespoons gochujang",
      "3 teaspoons sesame oil",
      "1 teaspoon vegetable oil",
      "1 green onion, chopped",
      "1 tablespoon roasted sesame seeds",
      "1 sheet of seaweed, roasted and shredded"
    ],
    "steps": [
      "Heat up a pan. Add the vegetable oil.",
      "Add the kimchi and stir fry for 1 minute.",
      "Add rice, kimchi juice, water, and gochujang. Stir all the ingredients together for about 7 minutes with a wooden spoon.",
      "Add sesame oil and remove from the heat.",
      "Sprinkle with chopped green onion, roasted gim, and sesame seeds. Serve right away."
    ],
    "tips": [],
    "tags": [
      "entree",
      "asian"
    ]
  },
  {
    "title": "Crab Bisque",
    "author": "Dana Dirksen",
    "image": "crab_bisque.jpg",
    "serves": 4,
    "prep_minutes": 20,
    "ingredients": [
      "Half a cooked crab",
      "⅓ Celery stalk  & celery leaves",
      "2 Carrots",
      "1 Onion",
      "Spices: Paprika, salt, pepper, garlic salt, old bay seasoning, 1 bay leaf, cloves all to taste",
      "⅓ cup Heavy Cream",
      "¾  cup Flour",
      "1 cup Milk",
      "Half a stick of Butter",
      "Pinch of fresh Parsley"
    ],
    "steps": [
      "Remove crab meat and set aside.  Boil the crab shells, half the celery, 1 carrot and half the onion, minced in 2 ⅕ cups of water and 1 can chicken broth for 30 minutes.",
      "Strain and squeeze the shells and vegetables into the pot.  Remove and set aside.",
      "Add the crab meat,remaining veggies, spices, parsley, milk and butter, stirring often.",
      "Once boiling, add flour with a bit of milk.",
      "Serve hot, with crusty bread, top with dried parsley flakes."
    ],
    "tips": [],
    "tags": [
      "entree"
    ]
  },
  {
    "title": "Beef Bulgogi",
    "author": "Dana Dirksen",
    "image": "beef_bulgogi.jpg",
    "serves": 4,
    "prep_minutes": 60,
    "ingredients": [
      "1 pound of beef tenderloin, sliced thinly into pieces ½ inch x 2 inches and ⅛ inch thick",
      "½ cup of crushed pear",
      "¼ cup onion purée",
      "4 cloves of minced garlic",
      "1 teaspoon minced ginger",
      "1 chopped green onion",
      "2 tbsp soy sauce",
      "2 tbsp brown sugar (or 1 tbsp of brown sugar and 1½ tbs rice syrup)",
      "a pinch of ground black pepper",
      "1 tbsp toasted sesame oil",
      "several thin slices of carrot"
    ],
    "steps": [
      "Mix all the marinade ingredients in a bowl.",
      "Add the sliced beef and mix well.",
      "You can grill, pan-fry, or BBQ right after marinating, but it’s best to keep it in the fridge and let it marinate for at least 30 minutes, or overnight for a tougher cut of beef.",
      "Serve with korean spicy sauce."
    ],
    "tips": [],
    "tags": [
      "entree",
      "korean"
    ]
  },
  {
    "title": "Andrea's Enchiladas",
    "author": "Andrea Heikkila",
    "image": "andreas_enchiladas.jpg",
    "serves": 8,
    "prep_minutes": 35,
    "ingredients": [
      "2 cups chicken breast",
      "2 cans cream of chicken soup",
      "1 can of green chilies",
      "1 Jalapeno",
      "1 onion",
      "1 small container of sour cream",
      "1 cup monterey jack cheese",
      "Corn tortillas"
    ],
    "steps": [
      "Combine chicken,  1 can cream of chicken soup, green chilies, jalapeno and onion into bowl and mix",
      "Optional fry the corn tortillas",
      "Roll the mix into the tortillas",
      "Combine sour cream and last can cream of chicken into another bowl and place on top of rolled tortillas",
      "Bake in the oven at 350 for 30 minutes",
      "Grate cheese onto dish and bake for 5 more minutes.",
      "Garnish with cilantro"
    ],
    "tips": [],
    "tags": [
      "entree",
      "mexican"
    ]
  }
]
